Autodesk.Revit.DB.LeaderShape
Since:
2016
Supported geometric shapes of annotation leaders.
Remarks:
Although the Autodesk::Revit::DB::Leader class supports
all available shapes, not all types of leaders may have the option to
change its shape. For example, leaders of text annotations can be of
any shape, while leaders of level lines are never curved.
Since:
2016